# -*- coding: utf-8 -*-

Token = "Your-Token"

helpgp = '''راهنمای مجیک استار ✨
⚡️ این دستورات مخصوص مدیران گروه است :

⚡️تنظیمات
#دریافت پنل قفل های گروه.

⚡️بستن گروه / بازکردن گروه
#بستن و به کردن گروه[بستن چت].

⚡️بیصدا 
#بیصدا کاربر با ریپلی روی یکی از پیغام هایش .

⚡️باصدا
#باصدا کردن با ریپلی روی یکی از پیغام هایش.

⚡️لیست سکوت
#دریافت لیست افراد ساکت شده.

⚡️تنظیم اسپم [عدد]
#تنظیم تعداد اسپم (محدودیت تعداد ارسال پیام).

⚡️تنظیم زمان [عدد]
#تنظیم زمان ارسال پیام مکرر.

⚡️فیلتر [کلمه]
#ممنوع کردن ارسال یک کلمه.

⚡️ازاد [کلمه]
#ازاد کردن ارسال یک کلمه.

⚡️لیست فیلتر
#دریافت لیست کلمات ممنوع شده.

⚡️ترفیع
#ناظم کردن یک کاربر توسط ریپلی روی یکی از پیغام های کاربر.

⚡️تنزل
#برکناری از ناظمیت یک کاربر توسط ریپلی روی یکی از پیغام های کاربر.

⚡️تنظیم لینک [لینک گروه]
⚡️تنظیم قوانین [قوانین گروه]
⚡️تنظیم نام [نام گروه]
⚡️تنظیم عکس [تنظیم عکس گروه با ریپلی روی عکس]
⚡️تنظیم سنجاق [سنجاق کردن یک پیام با ریپلی روی پیام]
⚡️تنظیم کاراکتر [تعداد کاراکتر]
#تنظیم تعداد حروف در جمله.

⚡️قوانین
#دریافت قوانین گروه.

⚡️لینک
#دریافت لینک گروه.

⚡️اخراج 
#اخراج یک کاربر با ریپلی روی یکی از پیغام های کاربر.'''

starttext = '''
💫 به ربات "آنتی اسپم Magic Star🌟 " خوش امدید ✨
⚜️ ساخته شده با ❤️ فقط برای شما ☺️
Git : https://github.com/Magic-Star/MagicBot.git '''

plugins = [
"start",
"groupmanager",
"tools",
"callback",
"msg-checks",
]

sup = 'GP Support'
sudos = [0000000]
